//Небольшие подсказки:
//
// 1. Во всех шагах далее вам нужно реализовать функцию, заданную в шаблоне решения.
// 2. Все из этих задач предполагают решение с помощью циклов.
// 3. На вход функции передаются разные данные, не только те, которые показаны в примерах.
// 4. Результат необходимо возвращать из функции с помощью оператора return
// 5. Если вдруг необходимо убрать лишние пробелы в начале/конце строки-ответа - используйте .trim()
// Пример работы с trim():

var z = " 'какой-то текст'    ";
// В начале и конце строки x находятся лишние пробелы, которые нужно удалить.
// Тогда вызов x.trim() вернет значение "какой-то текст" - уже без пробелов в начале и в конце.
// Обратите внимание, что метод .trim() не меняет значение исходного x, а только возвращает измененное значение.
    z.trim("");
    console.log(z);

        // ЗАДАЧА_1
//Найдите сумму  всех целых чисел от 1 до n включительно и верните из функции результат.

// Sample Input 1:
// 3
// Sample Output 1:
// 6
// Sample Input 2:
// 6
// Sample Output 2:
// 21

function testCycle(n) {
    var x;
    // Тут нужно написать решение
    return x;
}